MaJerle/stm32f429/00-STM32F429_LIBRARIES/tm_stm32f4_ethernet.h
/**
 * Connected callback
 *
 * This function is called when device is connected to specific server.
 *
 * Parameters:
 * 	- TM_TCPCLIENT_t* connection:
 * 		Pointer to TM_TCPCLIENT_t which contains current connection's specifications
 *
 * With __weak parameter to prevent link errors if not defined by user
 *
 * No return
 */
extern __weak void TM_ETHERNETCLIENT_ConnectedCallback(TM_TCPCLIENT_t* connection);

/**
 * Connection closed callback
 *
 * This function is called when connection is closed and you are ready to make a new one.
 * You can also detect, if connection was closed after success or error.
 *
 * Parameters:
 * 	- TM_TCPCLIENT_t* connection:
 * 		Pointer to TM_TCPCLIENT_t which contanins current connection specifications
 * 	- uint8_t success:
 *		It is set to 1 if connection was closed after successfull transmission
 *		or 0 if because of failure
 *
 * With __weak parameter to prevent link errors if not defined by user
 *
 * No return
 */
extern __weak void TM_ETHERNETCLIENT_ConnectionClosedCallback(TM_TCPCLIENT_t* connection, uint8_t success);

/**
 * Error callback
 *
 * This function is called when an error occured.
 * It will be called in case when IP address is not available
 *
 * Parameters:
 * 	- TM_TCPCLIENT_t* connection:
 * 		Pointer to TM_TCPCLIENT_t which contanins current connection specifications
 *
 * With __weak parameter to prevent link errors if not defined by user
 *
 * No return
 */
extern __weak void TM_ETHERNETCLIENT_ErrorCallback(TM_TCPCLIENT_t* connection);

/**
 * Connection started callback
 *
 * This function will be called when connection to server has started
 *
 * Parameters:
 * 	- TM_TCPCLIENT_t* connection:
 * 		Pointer to TM_TCPCLIENT_t which contanins current connection specifications
 *
 * With __weak parameter to prevent link errors if not defined by user
 *
 * No return
 */
extern __weak void TM_ETHERNETCLIENT_ConnectionStartedCallback(TM_TCPCLIENT_t* connection);

/* DNS based callbacks */
/**
 * DNS Found callback
 *
 * This function will be called when DNS server has valid IP address for your domain request.
 * It can be useful to make first connection in this function when you know your IP address where you must connect to.
 *
 * Parameters:
 * 	- char* host_name:
 * 		The same host name as you use for DNS requesting, can't be larger than ETHERNET_MAX_CONNECTION_NAME define
 * 	- uint8_t ip_addr1:
 * 		IP address 1st byte, MSB
 * 	- uint8_t ip_addr2:
 * 		IP address 2nd byte
 * 	- uint8_t ip_addr3:
 * 		IP address 3rd byte
 * 	- uint8_t ip_addr4:
 * 		IP address 4th byte, LSB
 *
 * With __weak parameter to prevent link errors if not defined by user
 *
 * No return
 */
extern __weak void TM_ETHERNETDNS_FoundCallback(char* host_name, uint8_t ip_addr1, uint8_t ip_addr2, uint8_t ip_addr3, uint8_t ip_addr4);

/**
 * DNS error callback
 *
 * This function will be called when DNS error occured.
 * Possible errors are:
 * 	- Requested domain does not exists,
 * 	- You have bad parameters in DNS function call
 *
 * Parameters:
 *  - char* host_name:
 *  	Host name where an error occured
 *
 * No return
 */
extern __weak void TM_ETHERNETDNS_ErrorCallback(char* host_name);

/* Server based callbacks */
/**
 * SSI callbacks for ethernet server
 *
 * This function is called, when ethernet server wants to serve tag you pass in TM_ETHERNETSERVER_SetSSITags() function.
 *
 * Parameters:
 * 	- int iIndex:
 * 		Tag index number. They are specified in order you pass to TM_ETHERNETSERVER_SetSSITags function
 * 	- char *pcInsert:
 * 		Pointer where you should set your content that will be displayed where your tag is specified in files
 * 	- int iInsertLen:
 * 		Max string length
 *
 * With __weak parameter to prevent link errors if not defined by user
 *
 * Must return number of characters in your pcInsert pointer.
 */
extern __weak uint16_t TM_ETHERNETSERVER_SSICallback(int iIndex, char *pcInsert, int iInsertLen);

/**
 * Called when new client is connected to server
 * This function can be used, to block IP address.
 * IP address, from where user access to your server is stored in *pcb variable
 *
 * remote_ip = pcb->remote_ip.addr
 *
 * You can check here for your blocked IP addresses
 *
 * Parameters:
 *	- struct tcp_pcb *pcb:
 *		Pointer to active LwIP PCB structure
 *
 * With __weak parameter to prevent link errors if not defined by user
 *
 * This function must return 1 if you want to allow connection,
 * or 0 if you want to deny access to your web.
 */
extern __weak uint8_t TM_ETHERNETSERVER_ClientConnectedCallback(struct tcp_pcb *pcb);

/**
 * Called when new client is diconnected from server (Or connection closed)
 *
 * With __weak parameter to prevent link errors if not defined by user
 *
 * No return
 */
extern __weak void TM_ETHERNETSERVER_ClientDisconnectedCallback(void);

/**
 * Called when user based file should be open when new client is connected
 * If you want to use server on your SDcard or USB flash or whatever,
 * here you can open file and do the stuff.
 *
 * Note: You must set file->len parameter to your file size number!
 *
 * If You don't open file (return 0) then default file in flash will be used,
 * that will say "Hello world from default server file", stored in fsdata.c.
 *
 * Only one file at a time will be opened, so if you need to mount card,
 * you can mount it in this function also.
 *
 * Parameters:
 *  - struct fs_file *file:
 *  	Pointer to fs_file struct
 *  - const char *name:
 *  	File name that should be opened
 *
 * With __weak parameter to prevent link errors if not defined by user
 *
 * Return 0 in case you can't/don't want to open file, or 1 if file is successfully opened
 */
extern __weak int TM_ETHERNETSERVER_OpenFileCallback(struct fs_file* file, const char *name);

/**
 * Called when reading file is finished and file can be closed.
 *
 * If you need to unmount your SD card, you can do it here.
 *
 * Parameters:
 * 	- struct fs_file *file:
 * 		Pointer to fs_file struct
 *
 * With __weak parameter to prevent link errors if not defined by user
 *
 * No return
 */
extern __weak void TM_ETHERNETSERVER_CloseFileCallback(struct fs_file* file);

/**
 * Called when file should be read.
 * This function may be called more than just one time, depends on file length.
 *
 * Parameters:
 * 	- struct fs_file *file:
 * 		Pointer to fs_file struct
 * 	- char *buffer:
 * 		Pointer to buffer, where you should save your data
 * 	- int count:
 * 		Number of data that should be read.
 * 		You can read less than this number. This is max number you can read this time.
 *
 * With __weak parameter to prevent link errors if not defined by user
 *
 * Returns number of read data, or -1 (EOF) if file has end.
 */
extern __weak int TM_ETHERNETSERVER_ReadFileCallback(struct fs_file* file, char* buffer, int count);

/**
 * Post request begin callback
 *
 * This function is called, when POST request is trying to be started to our server.
 *
 * With this function, you can accept/decline POST request, depending on parameters you receive
 *
 * Note:
 * After POST request finish, you have to choose one file, which will be used to displayed to user after successfull POST end.
 * If you don't set it by yourself, then "/index.html" file will be used.
 * You can do that to set your custom file:
 *
 * strcpy(params->response_uri, "/yourfile.html");
 *
 * In this structure are also other variables, which one, you should look at TM_ETHERNETPOST_t struct declaration.
 *
 * Parameters:
 * 	- TM_ETHERNETPOST_t* params:
 * 		Pointer to TM_ETHERNETPOST_t structure which contains everything about POST connection.
 * 		Look for TM_ETHERNETPOST_t struct comments what you can use in this function.
 *
 * With __weak parameter to prevent link errors if not defined by user
 *
 * This function must return 1 in case you want to accept POST request, or return 0 in case you want to deny it.
 * In params structure you have also HTTP headers, so you can look at them and deny access in some cases.
 */
extern __weak uint8_t TM_ETHERNETSERVER_PostRequestBeginCallback(TM_ETHERNETPOST_t* params);

/**
 * Post request receive data available callback
 *
 * This function is called, when we have "Content-Length" statement.
 * Function might be called multiple times, depends on how many data you try to sent over POST method.
 * Data are stored inside p->payload variable pointer, which is void pointer. Make a cast to char* variable.
 * In pbuf struct is also length of this packet, so you have a little control about that.
 *
 * To know when you have last time called this function, you can make a compare of params variables.
 *
 * Parameters:
 * 	- TM_ETHERNETPOST_t* params:
 * 		Pointer to TM_ETHERNETPOST_t structure which contains everything about POST connection.
 * 		Look for TM_ETHERNETPOST_t struct comments what you can use in this function.
 * 	- struct pbuf* p:
 * 		Pointer to pbuf structure where data are stored.
 *
 * With __weak parameter to prevent link errors if not defined by user
 *
 * This function must return 1 if you want to receive more data, or return 0 in case you want to stop POST request at some time.
 */
extern __weak uint8_t TM_ETHERNETSERVER_PostRequestReceiveDataCallback(TM_ETHERNETPOST_t* params, struct pbuf* p);

/**
 * Post request end callback
 *
 * This function is called when POST request is done.
 *
 * This function must set response_uri variable to set response URL, which will be used to show to user.
 * If you don't set it, then default will be used.
 *
 * Parameters:
 * 	- void* connection:
 * 		Pointer to connection parameters, it is type of struct http_state *
 * 	- char* response_uri:
 * 		Pointer to buffer for response uri set
 * 	- u16_t response_uri_len:
 * 		Length of response uri buffer length
 *
 * With __weak parameter to prevent link errors if not defined by user
 *
 * No return
 */
extern __weak void TM_ETHERNETSERVER_PostRequestEndCallback(void* connection, char* response_uri, u16_t response_uri_len);

/**
 * Called when ethernet peripheral is ready.
 * In this function, user can do other stuff, depending on PHY which is used in project.
 *
 * Example:
 *	- Set LED mode for DP83848 PHY, or something else
 * 
 * Parameters:
 * 	- uint32_t PHYAddress:
 * 		Phy address when using ETH_ReadPHYRegister and ETH_WritePHYRegister functions
 *
 * With __weak parameter to prevent link errors if not defined by user
 *
 * No return
 */
extern __weak void TM_ETHERNETPHY_CustomOptions(uint32_t PHYAddress);

/**
 * Called on ethernet GPIO initialization
 * In this function, user can initialize custom pins, which will be used for communication with PHY.
 * Don't implement this function in case you want default pinout
 *
 * With __weak parameter to prevent link errors if not defined by user
 *
 * Must return 1 in case user has made own pins, or 0 in case we want default pins
 */
extern __weak uint8_t TM_ETHERNET_InitPinsCallback(void);

/* Private functions which should not be called from user */
extern void TM_ETHERNET_INT_CustomOptions(uint32_t PHYAddress);
extern void TM_ETHERNET_INT_SetIPAddress(uint8_t ip_addr1, uint8_t ip_addr2, uint8_t ip_addr3, uint8_t ip_addr4, uint8_t dhcp);
extern void TM_ETHERNET_INT_LinkIsDownCallback(void);
extern void TM_ETHERNET_INT_LinkIsUpCallback(void);

/* C++ detection */
#ifdef __cplusplus
}
#endif

#endif

